Ran Plan for project: `wrestleutopia-prod` dir: `accounts/wrestleutopia-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_role_policy.crossaccount_s3_read_policy must be replaced
-/+ resource "aws_iam_role_policy" "crossaccount_s3_read_policy" {
      ~ id          = "CrossAccountS3ReadRole:WrestleUtopiaReadLogo" -> (known after apply)
      ~ name        = "WrestleUtopiaReadLogo" -> "ReadLogo" # forces replacement
      + name_prefix = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_lambda_function.fetch_data will be updated in-place
~ resource "aws_lambda_function" "fetch_data" {
        id                             = "fetch_data"
      ~ last_modified                  = "2025-03-26T12:12:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "ey+K7317SS9YPvwAFIH0MumLWjAqbG9tC8E+rkCwi3s=" -> "uMEXkDhvOl7u3P7ycQnP/a9l0odmoGYNICx22XAn6cw="
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.notify_post will be updated in-place
~ resource "aws_lambda_function" "notify_post" {
        id                             = "notify_post"
      ~ last_modified                  = "2025-03-26T12:12:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "JJea7YhCbe3HY9iRSN2IWbb4nNCW8yUMjyx8HPdFhnk=" -> "KN3RT/FX7oHBIS6+OXM3nqLwpOgBAAv7Lnjean7shpE="
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p wrestleutopia-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fwrestleutopia-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p wrestleutopia-prod
  ```
Plan: 1 to add, 2 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```